In [1]:
import pandas as pd
data = pd.DataFrame({'A':[1,2,3,4,12,15,45,85,45,45,78,54,1,25],
                    'B':[5,6,7,8,13,12,45,14,27,8,96,58,45,47],
                    'C':['c1','c1','c3','c3','c3','c3','b1','v1','v1','d1','d2','d2','d2','d1'],
                    'D':[0,1,0,1,0,1,0,0,0,1,1,0,1,0]})

In [2]:
data.head(3)

   A  B   C  D
0  1  5  c1  0
1  2  6  c1  1
2  3  7  c3  0

## filter

In [4]:
data['B']>45

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
11     True
12    False
13     True
Name: B, dtype: bool

## >

In [5]:
data[data['B']>45]

     A   B   C  D
10  78  96  d2  1
11  54  58  d2  0
13  25  47  d1  0

In [6]:
data[data['B']>45]['C']

10    d2
11    d2
13    d1
Name: C, dtype: object

In [7]:
data[(data['B']>45)&(data['D']==1)]

     A   B   C  D
10  78  96  d2  1

In [8]:
data[(data['B']>45)&(data['D']==1)]['C']

10    d2
Name: C, dtype: object

## Filter by loc

In [9]:
data.loc[data['B']>43,'C']

6     b1
10    d2
11    d2
12    d2
13    d1
Name: C, dtype: object